In [0]:
from pyspark.sql import SparkSession

# Initialize Spark session
spark = SparkSession.builder \
    .appName("SparkSQL_Transformations") \
    .getOrCreate()

# Load the dataset
file_path = "/FileStore/tables/Loan/loan.csv"
df = spark.read.csv(file_path, header=True, inferSchema=True)

# Register as SQL table
df.createOrReplaceTempView("loans")

In [0]:
# Sample SQL Queries Using Filter:
# Example 1. Filter loans with Income > 10,000
high_loans = spark.sql("SELECT * FROM loans WHERE `Income` > 10000")
high_loans.show()

# Example 1: Using Filter function Filter rows with Income > 10,000
high_loans_df = df.filter(df["Income"] > 2000)
high_loans_df.show()

+-----------+---+------+-------------------+--------------+-----------+------+-----------+-------------+----------------+-----------+-------+------------+----------------+------------------+
|Customer_ID|Age|Gender|         Occupation|Marital Status|Family Size|Income|Expenditure|Use Frequency|   Loan Category|Loan Amount|Overdue| Debt Record| Returned Cheque| Dishonour of Bill|
+-----------+---+------+-------------------+--------------+-----------+------+-----------+-------------+----------------+-----------+-------+------------+----------------+------------------+
|    IB14001| 30|  MALE|       BANK MANAGER|        SINGLE|          4| 50000|      22199|            6|         HOUSING| 10,00,000 |      5|      42,898|               6|                 9|
|    IB14008| 44|  MALE|          PROFESSOR|       MARRIED|          6| 51000|      19999|            4|        SHOPPING|     50,000|      3|      33,999|               1|                 5|
|    IB14012| 30|FEMALE|            DENTIST|        SINGLE|          3| 58450|      27675|            5|      TRAVELLING|     75,000|      6|      20,876|               3|                 1|
|    IB14018| 29|  MALE|            TEACHER|       MARRIED|          5| 45767|      12787|            3|       GOLD LOAN|  6,00,000 |      7|      11,000|               0|                 4|
|    IB14022| 34|  MALE|             POLICE|        SINGLE|          4| 43521|      11999|            3|      AUTOMOBILE|  2,00,000 |      2|      43,898|               1|                 2|
|    IB14024| 55|FEMALE|              NURSE|       MARRIED|          6| 34999|      19888|            4|      AUTOMOBILE|     47,787|      1|      50,000|               0|                 3|
|    IB14025| 39|FEMALE|            TEACHER|       MARRIED|          6| 46619|      18675|            4|         HOUSING| 12,09,867 |      8|      29,999|               6|                 8|
|    IB14027| 51|  MALE|     SYSTEM MANAGER|       MARRIED|          3| 49999|      19111|            5|     RESTAURANTS|     60,676|      8|      13,000|               2|                 5|
|    IB14029| 24|FEMALE|            TEACHER|        SINGLE|          3| 45008|      17454|            4|      AUTOMOBILE|  3,99,435 |      9|      51,987|               4|                 7|
|    IB14031| 37|FEMALE|  SOFTWARE ENGINEER|       MARRIED|          5| 55999|      23999|            5|      AUTOMOBILE|     60,999|      2|           0|               5|                 3|
|    IB14032| 24|  MALE|       DATA ANALYST|        SINGLE|          4| 60111|      28999|            6|      AUTOMOBILE|     35,232|      5|      33,333|               1|                 2|
|    IB14037| 54|FEMALE|            TEACHER|       MARRIED|          5| 48099|      19999|            4|     RESTAURANTS|     30,999|      1|      12,000|               7|                 5|
|    IB14039| 45|  MALE|    ACCOUNT MANAGER|       MARRIED|          7| 45777|      18452|            4|       GOLD LOAN|  9,87,611 |      7|      39,999|               8|                 1|
|    IB14041| 59|FEMALE|ASSISTANT PROFESSOR|       MARRIED|          4| 50999|      22999|            5|EDUCATIONAL LOAN|  5,99,934 |      3|       9,000|               9|                 9|
|    IB14042| 25|FEMALE|             DOCTOR|        SINGLE|          4| 60111|      27111|            5|      TRAVELLING| 12,90,929 |      4|      18,000|               1|                 0|
|    IB14045| 31|  MALE|       STORE KEEPER|        SINGLE|          5| 40999|      11999|            3|     BOOK STORES|  1,67,654 |      1|       4,500|               0|                 1|
|    IB14049| 49|  MALE|       BANK MANAGER|       MARRIED|          4| 45999|      14500|            4|      TRAVELLING|     79,999|      4|       6,700|               7|                 3|
|    IB14054| 58|FEMALE|             DOCTOR|       MARRIED|          5| 60000|      25000|            5|         HOUSING|  9,00,000 |      5|      21,000|               9|                 0|
|    IB14057| 25|  MALE|    AIRPORT OFFICER|        SINGLE|          4| 40000|      18888|            3|     RESTAURANTS|  4,00,000 |      8|      11,111|               1|                 7|
|    IB14060| 36|FEMALE|              CLERK|       MARRIED|          4| 35000|      15000|            3|         HOUSING|  3,00,000 |      2|       5,600|               4|                 8|
+-----------+---+------+-------------------+--------------+-----------+------+-----------+-------------+----------------+-----------+-------+------------+----------------+------------------+
only showing top 20 rows

+-----------+---+------+-------------------+--------------+-----------+------+-----------+-------------+----------------+-----------+-------+------------+----------------+------------------+
|Customer_ID|Age|Gender|         Occupation|Marital Status|Family Size|Income|Expenditure|Use Frequency|   Loan Category|Loan Amount|Overdue| Debt Record| Returned Cheque| Dishonour of Bill|
+-----------+---+------+-------------------+--------------+-----------+------+-----------+-------------+----------------+-----------+-------+------------+----------------+------------------+
|    IB14001| 30|  MALE|       BANK MANAGER|        SINGLE|          4| 50000|      22199|            6|         HOUSING| 10,00,000 |      5|      42,898|               6|                 9|
|    IB14008| 44|  MALE|          PROFESSOR|       MARRIED|          6| 51000|      19999|            4|        SHOPPING|     50,000|      3|      33,999|               1|                 5|
|    IB14012| 30|FEMALE|            DENTIST|        SINGLE|          3| 58450|      27675|            5|      TRAVELLING|     75,000|      6|      20,876|               3|                 1|
|    IB14018| 29|  MALE|            TEACHER|       MARRIED|          5| 45767|      12787|            3|       GOLD LOAN|  6,00,000 |      7|      11,000|               0|                 4|
|    IB14022| 34|  MALE|             POLICE|        SINGLE|          4| 43521|      11999|            3|      AUTOMOBILE|  2,00,000 |      2|      43,898|               1|                 2|
|    IB14024| 55|FEMALE|              NURSE|       MARRIED|          6| 34999|      19888|            4|      AUTOMOBILE|     47,787|      1|      50,000|               0|                 3|
|    IB14025| 39|FEMALE|            TEACHER|       MARRIED|          6| 46619|      18675|            4|         HOUSING| 12,09,867 |      8|      29,999|               6|                 8|
|    IB14027| 51|  MALE|     SYSTEM MANAGER|       MARRIED|          3| 49999|      19111|            5|     RESTAURANTS|     60,676|      8|      13,000|               2|                 5|
|    IB14029| 24|FEMALE|            TEACHER|        SINGLE|          3| 45008|      17454|            4|      AUTOMOBILE|  3,99,435 |      9|      51,987|               4|                 7|
|    IB14031| 37|FEMALE|  SOFTWARE ENGINEER|       MARRIED|          5| 55999|      23999|            5|      AUTOMOBILE|     60,999|      2|           0|               5|                 3|
|    IB14032| 24|  MALE|       DATA ANALYST|        SINGLE|          4| 60111|      28999|            6|      AUTOMOBILE|     35,232|      5|      33,333|               1|                 2|
|    IB14037| 54|FEMALE|            TEACHER|       MARRIED|          5| 48099|      19999|            4|     RESTAURANTS|     30,999|      1|      12,000|               7|                 5|
|    IB14039| 45|  MALE|    ACCOUNT MANAGER|       MARRIED|          7| 45777|      18452|            4|       GOLD LOAN|  9,87,611 |      7|      39,999|               8|                 1|
|    IB14041| 59|FEMALE|ASSISTANT PROFESSOR|       MARRIED|          4| 50999|      22999|            5|EDUCATIONAL LOAN|  5,99,934 |      3|       9,000|               9|                 9|
|    IB14042| 25|FEMALE|             DOCTOR|        SINGLE|          4| 60111|      27111|            5|      TRAVELLING| 12,90,929 |      4|      18,000|               1|                 0|
|    IB14045| 31|  MALE|       STORE KEEPER|        SINGLE|          5| 40999|      11999|            3|     BOOK STORES|  1,67,654 |      1|       4,500|               0|                 1|
|    IB14049| 49|  MALE|       BANK MANAGER|       MARRIED|          4| 45999|      14500|            4|      TRAVELLING|     79,999|      4|       6,700|               7|                 3|
|    IB14054| 58|FEMALE|             DOCTOR|       MARRIED|          5| 60000|      25000|            5|         HOUSING|  9,00,000 |      5|      21,000|               9|                 0|
|    IB14057| 25|  MALE|    AIRPORT OFFICER|        SINGLE|          4| 40000|      18888|            3|     RESTAURANTS|  4,00,000 |      8|      11,111|               1|                 7|
|    IB14060| 36|FEMALE|              CLERK|       MARRIED|          4| 35000|      15000|            3|         HOUSING|  3,00,000 |      2|       5,600|               4|                 8|
+-----------+---+------+-------------------+--------------+-----------+------+-----------+-------------+----------------+-----------+-------+------------+----------------+------------------+
only showing top 20 rows

In [0]:
# Sample SQL Queries Using Aggregation:
# 1. Aggregation: Calculate the average Income
avg_loan = spark.sql("SELECT AVG(Income) AS Avg_Income FROM loans")
avg_loan.show()

+-----------------+
|       Avg_Income|
+-----------------+
|68339.49145299145|
+-----------------+

In [0]:
# Sample SQL Queries Using GroupBy:
# 1. Grouping by Occupation and calculating the average Income for each occupation
# SQL Query to group by 'Occupation' and calculate average 'Income'
group_by_occupation_query = """
SELECT 
    Occupation, 
    AVG(Income) AS Avg_Income
FROM customer_info
GROUP BY Occupation
"""
group_by_occupation_result = spark.sql(group_by_occupation_query)
group_by_occupation_result.show()

#2. Grouping by Gender and calculating the total Expenditure for each gender
group_by_gender_query = """
SELECT 
    Gender, 
    SUM(Expenditure) AS Total_Expenditure
FROM customer_info
GROUP BY Gender
"""

group_by_gender_result = spark.sql(group_by_gender_query)
group_by_gender_result.show()

+----------+----------+
|Occupation|Avg_Income|
+----------+----------+
|  Engineer|   40000.0|
|   Teacher|   45000.0|
|    Doctor|   50000.0|
|    Lawyer|   60000.0|
| Architect|   55000.0|
+----------+----------+

+------+-----------------+
|Gender|Total_Expenditure|
+------+-----------------+
|  Male|           105000|
|Female|            65000|
+------+-----------------+

In [0]:
# Sample SQL Queries Using Joins:
# Create sample data for customer_info (5 records)
customer_data = [
    ("C001", 30, "Male", "Engineer", "Married", 3, 40000, 30000, 4, "Good", 0, 0),
    ("C002", 40, "Female", "Teacher", "Single", 2, 45000, 20000, 5, "Fair", 1, 1),
    ("C003", 35, "Male", "Doctor", "Married", 4, 50000, 35000, 6, "Excellent", 0, 0),
    ("C004", 50, "Female", "Lawyer", "Married", 5, 60000, 45000, 3, "Good", 0, 0),
    ("C005", 45, "Male", "Architect", "Single", 3, 55000, 40000, 7, "Fair", 1, 1)
]

# Create DataFrame for customer_info
customer_columns = ["Customer_ID", "Age", "Gender", "Occupation", "Marital Status", "Family Size", 
                    "Income", "Expenditure", "Use Frequency", "Debt Record", "Returned Cheque", "Dishonour of Bill"]
customer_info_df = spark.createDataFrame(customer_data, customer_columns)

# Create sample data for loan_info (5 records)
loan_data = [
    ("C001", "Personal", "50000", 1),
    ("C002", "Auto", "20000", 0),
    ("C003", "Home", "150000", 2),
    ("C004", "Education", "25000", 0),
    ("C005", "Personal", "100000", 1)
]

# Create DataFrame for loan_info
loan_columns = ["Customer_ID", "Loan Category", "Loan Amount", "Overdue"]
loan_info_df = spark.createDataFrame(loan_data, loan_columns)

# Register both DataFrames as temp views (tables)
customer_info_df.createOrReplaceTempView("customer_info")
loan_info_df.createOrReplaceTempView("loans")

# Inner Join: Get the customer details along with their loan information
inner_join_query = """
SELECT 
    c.Customer_ID, 
    c.Age, 
    c.Gender, 
    c.Occupation, 
    c.Income, 
    l.`Loan Category`, 
    l.`Loan Amount`, 
    l.Overdue
FROM customer_info c
INNER JOIN loans l 
ON c.Customer_ID = l.Customer_ID
"""

inner_join_result = spark.sql(inner_join_query)
inner_join_result.show()

# Left Join: Get all customers and their loan information (if available)
left_join_query = """
SELECT 
    c.Customer_ID, 
    c.Age, 
    c.Gender, 
    c.Occupation, 
    c.Income, 
    l.`Loan Category`, 
    l.`Loan Amount`, 
    l.Overdue
FROM customer_info c
LEFT JOIN loans l 
ON c.Customer_ID = l.Customer_ID
"""

left_join_result = spark.sql(left_join_query)
left_join_result.show()

+-----------+---+------+----------+------+-------------+-----------+-------+
|Customer_ID|Age|Gender|Occupation|Income|Loan Category|Loan Amount|Overdue|
+-----------+---+------+----------+------+-------------+-----------+-------+
|       C001| 30|  Male|  Engineer| 40000|     Personal|      50000|      1|
|       C002| 40|Female|   Teacher| 45000|         Auto|      20000|      0|
|       C003| 35|  Male|    Doctor| 50000|         Home|     150000|      2|
|       C004| 50|Female|    Lawyer| 60000|    Education|      25000|      0|
|       C005| 45|  Male| Architect| 55000|     Personal|     100000|      1|
+-----------+---+------+----------+------+-------------+-----------+-------+

+-----------+---+------+----------+------+-------------+-----------+-------+
|Customer_ID|Age|Gender|Occupation|Income|Loan Category|Loan Amount|Overdue|
+-----------+---+------+----------+------+-------------+-----------+-------+
|       C001| 30|  Male|  Engineer| 40000|     Personal|      50000|      1|
|       C002| 40|Female|   Teacher| 45000|         Auto|      20000|      0|
|       C003| 35|  Male|    Doctor| 50000|         Home|     150000|      2|
|       C004| 50|Female|    Lawyer| 60000|    Education|      25000|      0|
|       C005| 45|  Male| Architect| 55000|     Personal|     100000|      1|
+-----------+---+------+----------+------+-------------+-----------+-------+